zpflow/models/Recruit.php

SELECT `recID`, `recYear`, `recBatch`, `recDefault`, `recStart`, `recEnd`, `recViewPlace`, `recHealthPlace`, `recBack` FROM `recruit` ORDER BY `recDefault` DESC, `recYear` DESC, `recBatch` DESC LIMIT 20
SELECT COUNT(*) FROM `recruit`
---
	public static function getListInfo($offset,$rows,$orderInfo){
		$rows = self::find()->select(['recID','recYear','recBatch','recDefault','recStart','recEnd','recViewPlace','recHealthPlace','recBack'])
							->orderby($orderInfo)
							->offset($offset)
							->limit($rows)
							->asArray()
							->all();

		$total = self::find()->count();

SELECT `recID`, `recYear`, `recBatch`, `recDefault`, `recEnd` FROM `recruit` WHERE `recDefault` != 0 ORDER BY `recDefault`, `recYear` DESC, `recBatch` DESC
---
	public static function getOverRecBatch(){
		$infos = self::find()->select(['recID','recYear','recBatch','recDefault','recEnd','recViewPlace'])
							->where(['!=', 'recDefault', 0])
							->orderby('recDefault asc,recYear desc,recBatch desc')
							->asArray()
							->all();