zpflow/models/Share.php

SELECT * FROM `code` WHERE (`codeID`='01') AND (`codeTypeID`='PC') AND (`codeStatus`=1)
---
	public static function codeValue($codeArr = [],$data = ''){
        $codeNameArr = [];//代码名称数组
        foreach($codeArr as $code){
            $val = $data[$code[0]];
			$val_arr = explode("_", $val);
			$val_len = count($val_arr);
			if($val_len == 1){
				$codeFind = Code::find()->where(['codeID'=>$val,'codeTypeID'=>$code[1],'codeStatus'=>1])->one();