zpflow/models/User.php

SELECT * FROM `user` WHERE `uid`=1
---
	public static function findSingleByWhere($where = []){
		$info = self::find()->where($where)->asArray()->one();